## Top 8 Powerful Functions in Python for Deeper Data Analysis
1. groupBy
2. pivot_table
3. aggregate
4. cross_tab
5. concat
6. apply
7. lambda
8. del (Keyword)

### 1. GroupBy Function

In [1]:
import pandas as pd

In [2]:
insurance_data = pd.read_csv("insurance.csv")
insurance_data

      age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]

#### 1.1 Perfom initial analysis

In [13]:
insurance_data.isna().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [9]:
insurance_data.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1338.000000
mean     39.207025    30.663397     1.094918  13270.422265
std      14.049960     6.098187     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010

In [10]:
insurance_data["region"].unique()

array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)

#### 1.2 Pull up the average Insurance charges based on region

In [27]:
insurance_data.groupby(by = "region")["charges"].mean().round(2).sort_values() #chain_methods

region
southwest    12346.94
northwest    12417.58
northeast    13406.38
southeast    14735.41
Name: charges, dtype: float64

#### 1.3 Pull up the average Insurance charges based on region and sex

##### Discrete and Contiuous data
 * Discrete - Just countable/not measurable/ can't be segmented
 * Continuous - Measurable/have units/ can also be segmented

In [23]:
insurance_data.groupby(by = ["region","sex"])["charges"].mean().round(2).sort_values()

region     sex
southwest  female    11274.41
northwest  male      12354.12
           female    12479.87
northeast  female    12953.20
southwest  male      13412.88
southeast  female    13499.67
northeast  male      13854.01
southeast  male      15879.62
Name: charges, dtype: float64

### 2. Pivot Table

In [39]:
#Pivot_table is presentable comparing 2 categorical features
pd.pivot_table(data=insurance_data,values="charges",index="region",columns="sex").round()
#aggFun is having mean has a default
#values displays the measurable data
#index represents the rows
#columns represents the column

sex         female     male
region
northeast  12953.0  13854.0
northwest  12480.0  12354.0
southeast  13500.0  15880.0
southwest  11274.0  13413.0

### 3. Aggregate

##### Mostly used Aggregate functions
* sum
* max
* min
* average

In [41]:
insurance_data.head(7)

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520
5   31  female  25.740         0     no  southeast   3756.62160
6   46  female  33.440         1     no  southeast   8240.58960

#### 3.1 Find out the average Insurance charges based on region

In [8]:
insurance_data.groupby(by = "region")["charges"].mean().round(2).sort_values() #chain_methods

region
southwest    12346.94
northwest    12417.58
northeast    13406.38
southeast    14735.41
Name: charges, dtype: float64

insurance_data.groupby(by = ["region", "sex"])["charges"].agg(func = ["min","max", "mean", "sum"]).round(2)

#### 4. CrossTab
In pandas, a crosstab is used to compute a frequency table (or aggregation) between two or more variables—similar to a contingency table in statistics.

In [22]:
insurance_data.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

##### 4.1 How many smokers and non-smokers based on region?

In [34]:
pd.crosstab(index =insurance_data["region"], columns = insurance_data["smoker"])
#pd.crosstab(insurance_data["region"], insurance_data["smoker"])

smoker      no  yes
region
northeast  257   67
northwest  267   58
southeast  273   91
southwest  267   58

In [41]:
pd.crosstab(index =insurance_data["region"], columns = [insurance_data["smoker"],insurance_data["sex"]],margins=True)
#margins - do the subtotal of both columns and rows
#checking multiple column frequency

smoker        no         yes        All
sex       female male female male
region
northeast    132  125     29   38   324
northwest    135  132     29   29   325
southeast    139  134     36   55   364
southwest    141  126     21   37   325
All          547  517    115  159  1338

### 5. Concat
It is used to combine DataFrames or Series either row-wise or column-wise.

pd.concat(objs, axis=0, ignore_index=False, join="outer")

    objs → list of DataFrames / Series

    axis=0 → stack rows (default)

    axis=1 → add columns

    ignore_index=True → reset index

    join="inner" → keep only common columns

In [45]:
sales_data_2017 = pd.read_csv("sales-2017.csv")
sales_data_2018 = pd.read_csv("sales-2018.csv")
sales_data_2019 = pd.read_csv("sales-2019.csv")

In [48]:
pd.concat(objs = [sales_data_2017,sales_data_2018,sales_data_2019])

,Date,Voucher,Party,Product,Qty,Rate,Gross,Disc,Voucher Amount
0,1/4/2017,Sal:1,SOLANKI PLASTICS,DONA-VAI-9100,2,"1,690.00","3,380.00",NaN,"13,100.00"
1,1/4/2017,Sal:1,SOLANKI PLASTICS,LITE FOAM(1200),6,"1,620.00","9,720.00",NaN,NaN
2,1/4/2017,Sal:2,SARNESWARA TRADERS,VISHNU CHOTA WINE,500,23,"11,500.00",NaN,"30,990.00"
3,1/4/2017,Sal:2,SARNESWARA TRADERS,LITE FOAM(1200),6,"1,620.00","9,720.00",NaN,NaN
4,1/4/2017,Sal:2,SARNESWARA TRADERS,DONA-VAI-9100,5,"1,690.00","8,450.00",NaN,NaN
...,...,...,...,...,...,...,...,...,...
19171,10/10/2019,Sal:4935,K.SRIHARI,13*16 WHITE RK,400,16,"6,400.00",NaN,NaN
19172,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19173,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19174,NaN,Total,NaN,NaN,"99,284.90","175,381.65","2,203,649.50","20,680.00","2,189,014.50"
19175,NaN,Total,NaN,NaN,"2,710,193.00","5,519,888.40","53,360,791.40","672,984.00","52,830,224.40"

#### Level 4.5/5 Complexity Challenge

#### merge function() - explore

### 6. Apply

In [3]:
insurance_data

      age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]

#### 6.1 Create a new column in the same dataframe with the name "Eligibility Criteria" where if the age is > 20, say eligible else not

In [7]:
def validate_age(age):
    if age > 20:
        return "Eligible"
    else:
        return "Not Eligible"

In [10]:
insurance_data["Eligibility Criteria"] =  insurance_data["age"].apply(validate_age)
insurance_data

,age,sex,bmi,children,smoker,region,charges,Eligibility Criteria
0,19,female,27.900,0,yes,southwest,16884.92400,Not Eligible
1,18,male,33.770,1,no,southeast,1725.55230,Not Eligible
2,28,male,33.000,3,no,southeast,4449.46200,Eligible
3,33,male,22.705,0,no,northwest,21984.47061,Eligible
4,32,male,28.880,0,no,northwest,3866.85520,Eligible
...,...,...,...,...,...,...,...,...
1333,50,male,30.970,3,no,northwest,10600.54830,Eligible
1334,18,female,31.920,0,no,northeast,2205.98080,Not Eligible
1335,18,female,36.850,0,no,southeast,1629.83350,Not Eligible
1336,21,female,25.800,0,no,southwest,2007.94500,Eligible
1337,61,female,29.070,0,yes,northwest,29141.36030,Eligible

### 7. Lamda Function
* Nameless/anonymous Function

In [23]:
insurance_data["EC_Lambda"] = insurance_data["age"].apply(lambda x: "Eligible" if x>20 else "Not Eligible")
insurance_data

,age,sex,bmi,children,smoker,region,charges,Eligibility Criteria,EC_Lambda
0,19,female,27.900,0,yes,southwest,16884.92400,Not Eligible,Not Eligible
1,18,male,33.770,1,no,southeast,1725.55230,Not Eligible,Not Eligible
2,28,male,33.000,3,no,southeast,4449.46200,Eligible,Eligible
3,33,male,22.705,0,no,northwest,21984.47061,Eligible,Eligible
4,32,male,28.880,0,no,northwest,3866.85520,Eligible,Eligible
...,...,...,...,...,...,...,...,...,...
1333,50,male,30.970,3,no,northwest,10600.54830,Eligible,Eligible
1334,18,female,31.920,0,no,northeast,2205.98080,Not Eligible,Not Eligible
1335,18,female,36.850,0,no,southeast,1629.83350,Not Eligible,Not Eligible
1336,21,female,25.800,0,no,southwest,2007.94500,Eligible,Eligible
1337,61,female,29.070,0,yes,northwest,29141.36030,Eligible,Eligible

#### Exlore List Comprehension 3 examples
#### Explore lambda - map, filter, query

### 8. Del Keyword

In [24]:
del insurance_data["EC_Lambda"]

In [25]:
insurance_data

,age,sex,bmi,children,smoker,region,charges,Eligibility Criteria
0,19,female,27.900,0,yes,southwest,16884.92400,Not Eligible
1,18,male,33.770,1,no,southeast,1725.55230,Not Eligible
2,28,male,33.000,3,no,southeast,4449.46200,Eligible
3,33,male,22.705,0,no,northwest,21984.47061,Eligible
4,32,male,28.880,0,no,northwest,3866.85520,Eligible
...,...,...,...,...,...,...,...,...
1333,50,male,30.970,3,no,northwest,10600.54830,Eligible
1334,18,female,31.920,0,no,northeast,2205.98080,Not Eligible
1335,18,female,36.850,0,no,southeast,1629.83350,Not Eligible
1336,21,female,25.800,0,no,southwest,2007.94500,Eligible
1337,61,female,29.070,0,yes,northwest,29141.36030,Eligible